; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-6)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 1 of 6
2. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 1 of 6
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 1 of 6
4. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 2 of 6
5. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 3 of 6
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 3 of 6
7. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 3 of 6
8. (pick ball5 roomb right)
   deleted: (at ball5 roomb) (free right)
   added: (carry ball5 right)
   goals met: 3 of 6
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 3 of 6
10. (drop ball5 room3 right)
   deleted: (carry ball5 right)
   added: (at ball5 room3) (free right)
   goals met: 4 of 6
11. (drop ball6 room3 left)
   deleted: (carry ball6 left)
   added: (at ball6 room3) (free left)
   goals met: 5 of 6
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 5 of 6
13. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 5 of 6
14. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 5 of 6
15. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 6 of 6
